rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "THX-1138"], ["director", "George Lucas"], ["created_at", "2020-03-04 05:13:55.765597"], ["updated_at", "2020-03-04 05:13:55.765597"]]

  def same_director
    @all_ratings = Movie.all_ratings
    @movie = Movie.find(params[:id])
    if @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]